//
//  DZ 35 - Skut_TableView_Serch.h
//  DZ 35 - Skut_TableView_Search_2
//
//  Created by mac on 03.03.2018.
//  Copyright © 2018 Dima Zgera. All rights reserved.
//

#ifndef DZ_35___Skut_TableView_Serch_h
#define DZ_35___Skut_TableView_Serch_h

#include <stdio.h>

#endif /* DZ_35___Skut_TableView_Serch_h */


В этом уроке мы рассмотрели как один массив данных можно преобразовать в другой, более упорядоченный, да еще и с фильтрами. Нужно сделать пару практических упражнений.

Ученик.

1. Создайте класс студента. У него должны быть свойства: имя, фамилия и год рождения.
2. Генерируйте случайное количество студентов и отобразите их в вашей таблице. (слева имя и фамилия, а справа дата рождения)

Студент.

3. Сгрупируйте студентов по секциям месяцев рождения, то есть все кто родился в январе в одной секции, а если в феврале никто не родился, то и секции такой нет.
4. Внутри секции студенты должны быть отсортированы по имени по алфавиту, а если имена одинаковы, то и по фамилии (подсказка, лучше отсортировать массив вначале по 3 всем параметрам: дата, имя и фамилия)
5. Добавьте индекс бар для быстрого перехода по секциям

Мастер.

6. Добавьте серчбар как в видео, чтобы кнопочка кенсел анимировано добавлялась/уезжала и тд
7. Фильтруйте студентов каждый раз, когда вводится новая буква, причем совпадения ищите как в имени так и в фамилии

Супермен

8. Добавьте к серчбару сегментед контрол с тайтлами: Год рождения, Имя, фамилия (по умолчанию включен год рождения)
9. Когда пользователь переключает сегментед контрол, то секции меняются на соответствующие. Например если выбран контрол с именем, то студенты должны быть отсортированы по имя-фамилия-дата, и должны быть собраны в секции, соответствующие первой букве имени.
10. То же самое и для фамилий, фильтр = фамилия-дата-имя
11. если выбрана дата, то все должно отсортироваться как в начале.

желаю успехов :)
